blog/content-org/posts.org
#+HUGO_BASE_DIR: ../
* WLAN QRcode generator                                                :tool:
:PROPERTIES:
:EXPORT_FILE_NAME: qrcode
:EXPORT_DATE: [2022-10-09 Sun]
:END:

#+begin_export html
<script src="https://cdnjs.cloudflare.com/ajax/libs/qrcodejs/1.0.0/qrcode.min.js"></script>

<center>
  <div id="qrcode";></div>
  <input type="text" id="ssid" placeholder="Network Name" oninput="generate_qrcode()">
  <br>
  <input type="password" id="pass" placeholder="Password" oninput="generate_qrcode()">
  <br>
  <code id="qrstring">
  </code>
</center>

<script>
function generate_qrcode() {
    let ssid = document.getElementById("ssid").value,
        pass = document.getElementById("pass").value,
        qrstring = document.getElementById("qrstring"),
        qrcode = document.getElementById("qrcode");

    let code = `WIFI:S:${ssid};T:WPA;P:${pass};;`
    qrstring.innerHTML = code

    while (qrcode.lastChild) {
        qrcode.removeChild(qrcode.lastChild);
    }

    new QRCode(qrcode, code);
}

function init() {
    document.getElementById("ssid").focus()
    generate_qrcode()
}

window.addEventListener("load", init);
</script>
#+end_export

** How it works

Many people often ask me how I generated the QRCode for my Wireless
network, so I decided to write this for them.
Nowadays it is quite often that the routers come with the QRcode already
baked in or they provide ways of generating the QRcode through their
admin webiste. However not everyone is able to easily access to the router
admin page or maybe some other websites on the internet are full of ads or are
simply too slow.
That is why I provide here this minimal functionality with an explanation.

The above QRCode simply encodes a special string that the application that
is scanning understands. Let us suppose that your wireless network
is called *Homer* and the password is *123456789*, then the QRCode simply
encodes the following text

#+begin_example
WIFI:S:Homer;T:WPA;P:123456789;;
#+end_example

Therefore, this website is just a helping tool for you to convert
this piece of text into an image, that your camera app can then read
and maybe it recognises that the text starts with the word =WIFI=
and logs you in automatically.


** References

- The code simply uses the great library by [[https://github.com/davidshimjs][@davidshimjs]]
  [[https://github.com/davidshimjs/qrcodejs][qrcodejs]].


